01 ADDRESS-RECORD.
          05 ADDRESS-LINE-1 PIC X(30).
          05 ADDRESS-LINE-2 PIC X(30).
          05 ADDRESS-POSTAL-CODE PIC X(10).
          05 ADDRESS-COUNTRY PIC X(3).
          05 ADDRESS-TYPE PIC X.
          05 FILLER PIC X(6).
