//BILLDAY JOB (OPS),'BILLING',CLASS=A,MSGCLASS=X
//BILL EXEC PGM=ORDBILL
//REPORT EXEC PGM=ORDRPT,COND=(0,NE,BILL)
//SYSIN DD DSN=RETAIL.CTL(BILLCTL),DISP=SHR
