//SHIPDAY JOB (OPS),'SHIPMENT BUILD',CLASS=A,MSGCLASS=X
//SORT1 EXEC PGM=SORT
//SYSIN DD DSN=RETAIL.CTL(SHIPSORT),DISP=SHR
//SHIP EXEC PROC=SHIPPROC,COND=(4,LT,SORT1)
//RPTOUT DD DSN=RETAIL.SHIP.REPORT,DISP=(NEW,CATLG,DELETE)
