01 ACCOUNT-RECORD.
          05 ACCT-NO PIC X(12).
          05 ACCT-CUST-ID PIC X(10).
          05 ACCT-TYPE PIC X(2).
          05 ACCT-BALANCE PIC S9(11)V99 COMP-3.
          05 ACCT-AVAILABLE PIC S9(11)V99 COMP-3.
          05 ACCT-LAST-DATE PIC 9(8).
          05 ACCT-STATUS PIC X.
          05 FILLER PIC X(38).
