01 TRANSACTION-CODE-TABLE.
          05 TXN-CODE-ENTRY OCCURS 5 TIMES.
             10 VALID-TXN-CODE PIC X(4).
             10 TXN-CODE-DESC PIC X(20).
