01 RESTART-CONTROL.
          05 RESTART-JOB PIC X(8).
          05 RESTART-STEP PIC X(8).
          05 RESTART-LAST-KEY PIC X(20).
          05 RESTART-STATUS PIC X.
