//CUSTMAINT JOB (ACCT),'CUSTOMER UPDATE',CLASS=A,MSGCLASS=X
//UPD EXEC PROC=CUSTPROC
//CUSTIN DD DSN=BANK.CUSTOMER.UPDATE,DISP=SHR
//CUSTOUT DD DSN=BANK.CUSTOMER.MASTER.NEW,DISP=(NEW,CATLG,DELETE)
//SYSIN DD *
MODE=VALIDATE
/*
