IDENTIFICATION DIVISION.
       PROGRAM-ID. AUDLOG.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
       COPY AUDREC.
       LINKAGE SECTION.
       01 LK-EVENT PIC X(80).
       01 LK-RC PIC S9(4) COMP.
       PROCEDURE DIVISION USING LK-EVENT LK-RC.
       MAIN.
           MOVE LK-EVENT TO AUD-MESSAGE
           ACCEPT AUD-TIME FROM TIME
           MOVE 0 TO LK-RC
           GOBACK.
